
//Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
//	СтандартнаяОбработка = Ложь;
//	Поля.Добавить("Фамилия");
//	Поля.Добавить("Имя");
//	Поля.Добавить("Отчество");
//	Поля.Добавить("ЭтоГруппа");
//	Поля.Добавить("Наименование");
//КонецПроцедуры

//Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
//	Если Не Данные.ЭтоГруппа Тогда
//		
//		СтандартнаяОбработка = Ложь;
//		Представление = Данные.Фамилия+" "+Данные.Имя+" "+Данные.Отчество;
//			
//	КонецЕсли;
//КонецПроцедуры
