Функция СохранитьФайлНаСервере(Ссылка, Хранилище) Экспорт

	КаталогФайлов = Константы.ПутьККаталогуХранилища.Получить();
	Каталог = Новый Файл(КаталогФайлов);
	Если Не Каталог.Существует() Тогда
		
		Сообщить("Каталог файлов не найден");
		Возврат Ложь;
	
	КонецЕсли;
	
	ИмяФайла = КаталогФайлов+"\"+Ссылка.УникальныйИдентификатор();
	ДвоичныеДанные = Хранилище.Получить();
	ДвоичныеДанные.Записать(ИмяФайла);
	Возврат Истина;

КонецФункции // СохранитьФайлНаСервере()

Функция ПолучитьФайлНаСервере(Ссылка, Хранилище) Экспорт

	КаталогФайлов = Константы.ПутьККаталогуХранилища.Получить();
	Каталог = Новый Файл(КаталогФайлов);
	Если Не Каталог.Существует() Тогда
		
		Сообщить("Каталог файлов не найден");
		Возврат Ложь;
	
	КонецЕсли;
	
	ИмяФайла = КаталогФайлов+"\"+Ссылка.УникальныйИдентификатор();
	Файл = Новый Файл(ИмяФайла);
	Если Файл.Существует() Тогда
		
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла);
		Хранилище = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
		Возврат Истина;
		
	Иначе
		
		Сообщить("Файл не найден");
		Возврат Ложь;
	
	КонецЕсли;
	
КонецФункции // ПолучитьФайлНаСервере()

Процедура УдалитьФайлНаСервере(Ссылка) Экспорт

	КаталогФайлов = Константы.ПутьККаталогуХранилища.Получить();
	ИмяФайла = КаталогФайлов+"\"+Ссылка.УникальныйИдентификатор();
	
	УдалитьФайлы(ИмяФайла);

КонецПроцедуры






