
&НаКлиенте
Процедура ВыделитьДолжников(Команда)
	
	ЭлементыУсловногоОформления =  Список.КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы;
	
	ВыделитьДолжников = Неопределено;
	Для каждого ЭлементОформления Из ЭлементыУсловногоОформления Цикл
	
		Если ЭлементОформления.Представление = "Выделить должников" Тогда
			
			ВыделитьДолжников = ЭлементОформления;
			Прервать;
		
		КонецЕсли;
	
	КонецЦикла;
	
	Если ВыделитьДолжников = Неопределено Тогда
		
		ВыделитьДолжников = ЭлементыУсловногоОформления.Добавить();
		ВыделитьДолжников.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
		
		ОтборДолг = ВыделитьДолжников.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборДолг.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Долг");
		ОтборДолг.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
		ОтборДолг.ПравоеЗначение = 0;
		ОтборДолг.Использование = Истина;
		
		ОформляемоеПоле = ВыделитьДолжников.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Наименование");
		
		ВыделитьДолжников.Представление = "Выделить должников";
		ВыделитьДолжников.Использование = Истина;
		
		ВыделитьДолжников.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
	Иначе
		
		ВыделитьДолжников.Использование = Не ВыделитьДолжников.Использование;
		
	КонецЕсли;
	
	Элементы.ФормаВыделитьДолжников.Пометка = ВыделитьДолжников.Использование;
	
КонецПроцедуры

&НаКлиенте
Процедура Тест(Команда)
	ТестНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестНаСервере()
	
	Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакета.Выполнить(Схема, Настройки);
		
КонецПроцедуры
