
//Процедура ПередНачаломРаботыСистемы(Отказ)
//	Если ОбщийСерверВызов.УстановкаНастроек() Тогда
//		ЗавершитьРаботуСистемы(Ложь,Истина);
//	КонецЕсли;
//КонецПроцедуры


Функция УстановкаНастроек() Экспорт
	
	Перезапуск = Ложь;
	
	Такси = Ложь;
	ИмяПользователя = ИмяПользователя();
	
	НастройкиКлиента = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения", "",, ИмяПользователя);
			
	Сообщить(НастройкиКлиента.ВариантИнтерфейсаКлиентскогоПриложения);		
	
	Если Такси и НастройкиКлиента.ВариантИнтерфейсаКлиентскогоПриложения = ВариантИнтерфейсаКлиентскогоПриложения.Версия8_2 Тогда
		НастройкиКлиента = Новый НастройкиКлиентскогоПриложения;
		НастройкиКлиента.ВариантИнтерфейсаКлиентскогоПриложения = ВариантИнтерфейсаКлиентскогоПриложения.Такси;
		
		НастройкиИнтерфейса = Новый НастройкиКомандногоИнтерфейса;
		НастройкиИнтерфейса.ОтображениеПанелиРазделов = ОтображениеПанелиРазделов.КартинкаИТекст;
		
		НастройкиСостава = Новый НастройкиСоставаИнтерфейсаКлиентскогоПриложения;
		ГруппаВерх = Новый ГруппаНастройкиСоставаИнтерфейсаКлиентскогоПриложения;
		ГруппаВерх.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельИнструментов"));
		ГруппаВерх.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельОткрытых"));
		НастройкиСостава.Верх.Добавить(ГруппаВерх);
		НастройкиСостава.Лево.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельРазделов"));
		
		НастройкиТакси = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
		НастройкиТакси.УстановитьСостав(НастройкиСостава);
		
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения", "",
			НастройкиКлиента, , ИмяПользователя);
			
		ХранилищеСистемныхНастроек.Сохранить("Общее/ПанельРазделов/НастройкиКомандногоИнтерфейса", "",
			НастройкиИнтерфейса, , ИмяПользователя);
			
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", "",
			НастройкиТакси, , ИмяПользователя);
		Перезапуск = Истина;
	КонецЕсли;
		
	Если Не Такси и НастройкиКлиента.ВариантИнтерфейсаКлиентскогоПриложения = ВариантИнтерфейсаКлиентскогоПриложения.Такси Тогда
		НастройкиКлиента = Новый НастройкиКлиентскогоПриложения;
		НастройкиКлиента.ОтображатьПанелиНавигацииИДействий = Ложь;
		НастройкиКлиента.ОтображатьПанельРазделов = Истина;
		НастройкиКлиента.РежимОткрытияФормПриложения = РежимОткрытияФормПриложения.Закладки;
		НастройкиКлиента.ВариантИнтерфейсаКлиентскогоПриложения = ВариантИнтерфейсаКлиентскогоПриложения.Версия8_2;
		
		НастройкиИнтерфейса = Новый НастройкиКомандногоИнтерфейса;
		НастройкиИнтерфейса.ОтображениеПанелиРазделов = ОтображениеПанелиРазделов.Текст;
		
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения", "",
			НастройкиКлиента, , ИмяПользователя);
			
		ХранилищеСистемныхНастроек.Сохранить("Общее/ПанельРазделов/НастройкиКомандногоИнтерфейса", "",
			НастройкиИнтерфейса, , ИмяПользователя);
			
		Перезапуск = Истина;	
		
	КонецЕсли;
		
	Возврат Перезапуск;
	
КонецФункции 