Процедура ВыполнитьОбработку(ИмяОбработки, ИмяПроцедуры, СтруктураПараметров) Экспорт
	
	ИмяВременногоФайла = "";
	
	Если СтруктураПараметров.ВнешняяОбработка Тогда
	
		Если ТипЗнч(ИмяОбработки) = Тип("Строка") Тогда
		
			Обработка = ВнешниеОбработки.Создать(ИмяОбработки,Ложь);
			
		Иначе
			
			ДвоичныеДанные = ИмяОбработки.Получить();
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("epf");
			ДвоичныеДанные.Записать(ИмяВременногоФайла);
			Обработка = ВнешниеОбработки.Создать(ИмяВременногоФайла,Ложь);
		
		КонецЕсли;
		
	Иначе
		
		Обработка = Обработки[ИмяОбработки].Создать();
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Обработка,СтруктураПараметров);
	Выполнить("Обработка."+ИмяПроцедуры+"();");		

	Если ИмяВременногоФайла<>"" Тогда
	
		УдалитьФайлы(ИмяВременногоФайла);
	
	КонецЕсли;
	
КонецПроцедуры














