
Процедура ОбработкаДанных() Экспорт
	
	Для А = 1 По КоличествоЭлементовДляОбработки Цикл
	
		Комментарий = "Обработка данных ("+Формат(А,"ЧГ=")+" из "+Формат(КоличествоЭлементовДляОбработки,"ЧГ=")+")";
		Сообщить("#К"+Комментарий);
		ОбработатьЭлемент();
		
	КонецЦикла;
	Сообщить("Все готово!");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка,
		|	Номенклатура.Наименование,
		|	Номенклатура.ВидНоменклатуры
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	Хранилище = Новый ХранилищеЗначения(ТЗ,Новый СжатиеДанных(9));
	ХранилищеСтр = ЗначениеВСтрокуВнутр(Хранилище);
	Сообщить("#Д"+ХранилищеСтр);
	
КонецПроцедуры                                         

Процедура ОбработатьЭлемент()

	ТекДата = ТекущаяДата();
	Пока ТекущаяДата()-ТекДата<1 Цикл
	
		
	
	КонецЦикла;

КонецПроцедуры













