
&НаКлиенте
Процедура ПолучитьДанные(Команда)
	ПолучитьДанныеНаСервере(АдресВХранилище,ИдентификаторЗадания);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьДанныеНаСервере(АдресВХранилище,ИдентификаторЗадания)
	
	ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	Если ФоновоеЗадание.Состояние <> СостояниеФоновогоЗадания.Активно Тогда
		ТЗ = ПолучитьИзВременногоХранилища(АдресВХранилище);
		Если ТЗ<>Неопределено Тогда
			Сообщить("Получена таблица, общее количество строк - "+ТЗ.Количество());
		КонецЕсли;
	Иначе
		Сообщить("Задание еще не завершено");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(Неопределено,УникальныйИдентификатор); 
	
	мПараметры = Новый Массив;
	мПараметры.Добавить(АдресВХранилище);
	
	ФоновоеЗадание = ФоновыеЗадания.Выполнить("МодульФоновыеЗаданияУпрИнтерфейс.ТестовоеЗадание",мПараметры);
	ИдентификаторЗадания = ФоновоеЗадание.УникальныйИдентификатор;
	
КонецПроцедуры
