
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для А=1 По 5000 Цикл
		НовСтр = Объект.ТабЧасть.Добавить();
		НовСтр.Объект = "Объект "+А;
		НовСтр.Показатель = 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНаКлиенте(Команда)
	
	Для каждого Стр Из Объект.ТабЧасть Цикл
		Стр.Показатель = Стр.Показатель+1		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаНаСервере(Команда)
	
	ОбработкаНаСервереНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаНаСервереНаСервере()
	
	Для каждого Стр Из Объект.ТабЧасть Цикл
		Стр.Показатель = Стр.Показатель+1		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстныйВызов(Команда)
	КонтекстныйВызовНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонтекстныйВызовНаСервере()
	
	НовСтр = Объект.ТабЧасть.Добавить();
	НовСтр.Объект = "Дополнительный";
	НовСтр.Показатель = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередачаЧерезПараметр(Команда)
	ПередачаЧерезПараметрНаСервере(Объект.ТабЧасть);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПередачаЧерезПараметрНаСервере(Знач ТабЧасть)

		
КонецПроцедуры
